templates/backwardStepLaminarTemplate/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          30;
        startFace       26058;
    }
    outlet
    {
        type            patch;
        nFaces          57;
        startFace       26088;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          255;
        startFace       26145;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          282;
        startFace       26400;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          26370;
        startFace       26682;
    }
)

// ************************************************************************* //
